amirreza-salehpor/Menu_elevator-driver_4Digit_Sevensegment_STM32G030K8T8/Code/Core/Store_Flash/Store_Flash.c
#include "Store_Flash.h"
//#include "stm32G0xx_hal.h"
#include "stm32G0xx_hal_flash.h"

// Defualt value is Commercial mode
char Default_Flash_Array[255];



//---------------------------------- Reserve in Flash
uint8_t Byte_1_Device_Mode=0x6B; //107 : If you make changes to your settings, you need to update the number of settings here
//----------------------------------


//----------------------------------------------------
//------------------------ Coefficients for Default
//---------------------------------------------------- 
#define Low_speed_D 12
#define Lock_Distance_D 6
#define Accel_Lock_D 6


uint8_t Obstacle_KP_D[1]=                {20};                  															//OBP
uint8_t Learnig_Speed_D[1]=              {10};                          											//LSP
uint8_t Open_Accel_D[6]=                 {4,Accel_Lock_D,Accel_Lock_D,6,4,4};           	    //OPA
uint8_t Open_Speed_D[6]=                 {8,Low_speed_D,6,60,10,5};      										  //OPS
uint8_t Open_Current_D[6]=               {100,100,100,100,100,100};   												//OPC
uint8_t Open_Position_D[6]=              {0,1,4,Lock_Distance_D,50,98};     									//OPP
uint8_t Close_Accel_D[6]=                {4,10,4,Accel_Lock_D,Accel_Lock_D,Accel_Lock_D};     //CLA
uint8_t Close_Speed_D[6]=                {7,60,6,Low_speed_D,5,1};        										//CLS
uint8_t Close_Current_D[6]=              {100,100,100,100,100,100};   												//CLC
uint8_t Close_Position_D[6]=             {100,98,55,Lock_Distance_D,3,1};   									//CLP
uint8_t Stop_Accel_D[6]=                 {20,20,20,20,20,20};  				  											//BRA
uint8_t Stop_Speed_D[6]=                 {0,0,0,0,0,0};         															//BRS
uint8_t Stop_Current_D[6]=               {100,100,100,100,100,100};   												//BRC
uint8_t Stop_Position_D[6]=              {100,98,50,6,3,1};     															//BRP
uint8_t KP_Detection_Time_D[1]=          {10};                  															//OBD
uint8_t KP_Speed_Constant_D[1]=          {50};                 															  //OPC
uint8_t Opening_Destination_D[1]=        {11};                 													  		//DLO
uint8_t Closing_Destination_D[1]=        {8};                 														  	//DLC
uint8_t Normal_Jerk_D[1]=                {6};                  															  //NOJ
uint8_t Stop_Jerk_D[1]=                  {40};                   															//RDJ
uint8_t Over_Heat_Limit_D[1]=            {70};                  															//OHL
uint8_t Over_Load_Limit_D[1]=            {15};                  															//OLL
uint8_t Over_Load_Time_D[1]=             {30};                  															//OLD
uint8_t Motor_Pole_Number_D[1]=          {16};                  															//POC
uint8_t Motor_Nominal_Current_D[1]=      {100};                  															//CUR *10
uint8_t Motor_Nominal_Voltage_D[1]=      {50};                 															  //VOL *2
uint8_t Motor_Nominal_Speed_D[1]=        {80};                 															  //    *5
uint8_t Buzzer_Activation_D[1]=          {0};                   															//BUA	
//-----------------------------------------
uint8_t Tune_Mode_Flash_D[1]=            {0};                   															//LRN	
uint8_t Door_Direction_D[1]=             {0};                   															//DOD	
uint8_t Command_Source_Mode_D[1]=        {1};                   															//CSR	
uint8_t Demo_D[1]=                       {0};                   															//DENO
//-----------------------------------------
uint8_t Device_Mode_D[1]=                {0};
//-----------------------------------------


//----------------------------------------------------
//------------------------ Coefficients for Default
//---------------------------------------------------- 
#define Low_speed_D 12
#define Lock_Distance_D 6
#define Accel_Lock_D 6


uint8_t Obstacle_KP_C[1]=                {20};                  															//OBP
uint8_t Learnig_Speed_C[1]=              {10};                          											//LSP
uint8_t Open_Accel_C[6]=                 {4,Accel_Lock_D,Accel_Lock_D,6,4,4};           	    //OPA
uint8_t Open_Speed_C[6]=                 {8,Low_speed_D,6,60,10,5};      										  //OPS
uint8_t Open_Current_C[6]=               {100,100,100,100,100,100};   												//OPC
uint8_t Open_Position_C[6]=              {0,1,4,Lock_Distance_D,50,98};     									//OPP
uint8_t Close_Accel_C[6]=                {4,10,4,Accel_Lock_D,Accel_Lock_D,Accel_Lock_D};     //CLA
uint8_t Close_Speed_C[6]=                {7,60,6,Low_speed_D,5,1};        										//CLS
uint8_t Close_Current_C[6]=              {100,100,100,100,100,100};   												//CLC
uint8_t Close_Position_C[6]=             {100,98,55,Lock_Distance_D,3,1};   									//CLP
uint8_t Stop_Accel_C[6]=                 {20,20,20,20,20,20};  				  											//BRA
uint8_t Stop_Speed_C[6]=                 {0,0,0,0,0,0};         															//BRS
uint8_t Stop_Current_C[6]=               {100,100,100,100,100,100};   												//BRC
uint8_t Stop_Position_C[6]=              {100,98,50,6,3,1};     															//BRP
uint8_t KP_Detection_Time_C[1]=          {10};                  															//OBD
uint8_t KP_Speed_Constant_C[1]=          {50};                 															  //OPC
uint8_t Opening_Destination_C[1]=        {11};                 													  		//DLO
uint8_t Closing_Destination_C[1]=        {8};                 														  	//DLC
uint8_t Normal_Jerk_C[1]=                {6};                  															  //NOJ
uint8_t Stop_Jerk_C[1]=                  {40};                   															//RDJ
uint8_t Over_Heat_Limit_C[1]=            {70};                  															//OHL
uint8_t Over_Load_Limit_C[1]=            {15};                  															//OLL
uint8_t Over_Load_Time_C[1]=             {30};                  															//OLD
uint8_t Motor_Pole_Number_C[1]=          {16};                  															//POC
uint8_t Motor_Nominal_Current_C[1]=      {100};                  															//CUR *10
uint8_t Motor_Nominal_Voltage_C[1]=      {50};                 															  //VOL *2
uint8_t Motor_Nominal_Speed_C[1]=        {80};                 															  //NSP *5
uint8_t Buzzer_Activation_C[1]=          {0};                   															//BUA	
//-----------------------------------------
uint8_t Tune_Mode_Flash_C[1]=            {0};                   															//LRN	
uint8_t Door_Direction_C[1]=             {0};                   															//DOD	
uint8_t Command_Source_Mode_C[1]=        {1};                   															//CSR	
uint8_t Demo_C[1]=                       {0};                   															//DENO
//-----------------------------------------
uint8_t Device_Mode_C[1]=                {0};
//-----------------------------------------


//----------------------------------------------------
//------------------------ Coefficients for Household
//---------------------------------------------------- 

#define Low_speed_H 15
#define Lock_Distance_H 6
#define Accel_Lock_H 6


