amirreza-salehpor/Menu_elevator-driver_4Digit_Sevensegment_STM32G030K8T8/Code/Core/Store_Flash/Store_Flash.c
uint8_t Obstacle_KP_H[1]=                {21};                  															//OBP
uint8_t Learnig_Speed_H[1]=              {15};                          											//LSP
uint8_t Open_Accel_H[6]=                 {4,Accel_Lock_D,Accel_Lock_D,10,10,10};           	  //OPA
uint8_t Open_Speed_H[6]=                 {8,Low_speed_D,8,90,25,8};      										  //OPS
uint8_t Open_Current_H[6]=               {100,100,100,100,100,100};   												//OPC
uint8_t Open_Position_H[6]=              {0,3,6,Lock_Distance_D,68,95};     									//OPP
uint8_t Close_Accel_H[6]=                {4,10,6,Accel_Lock_D,Accel_Lock_D,Accel_Lock_D};     //CLA
uint8_t Close_Speed_H[6]=                {12,90,8,Low_speed_D,8,8};        										//CLS
uint8_t Close_Current_H[6]=              {100,100,100,100,100,100};   												//CLC
uint8_t Close_Position_H[6]=             {100,98,55,Lock_Distance_D,3,1};   									//CLP
uint8_t Stop_Accel_H[6]=                 {10,10,10,10,10,10};  				  											//BRA
uint8_t Stop_Speed_H[6]=                 {0,0,0,0,0,0};         															//BRS
uint8_t Stop_Current_H[6]=               {100,100,100,100,100,100};   												//BRC
uint8_t Stop_Position_H[6]=              {100,98,50,6,3,1};     															//BRP
uint8_t KP_Detection_Time_H[1]=          {10};                  															//OBD
uint8_t KP_Speed_Constant_H[1]=          {50};                 															  //OPC
uint8_t Opening_Destination_H[1]=        {100};                 															//DLO
uint8_t Closing_Destination_H[1]=        {100};                 															//DLC
uint8_t Normal_Jerk_H[1]=                {15};                  															//NOJ
uint8_t Stop_Jerk_H[1]=                  {10};                   															//RDJ
uint8_t Over_Heat_Limit_H[1]=            {50};                  															//OHL
uint8_t Over_Load_Limit_H[1]=            {15};                  															//OLL
uint8_t Over_Load_Time_H[1]=             {30};                  															//OLD
uint8_t Motor_Pole_Number_H[1]=          {16};                  															//POC
uint8_t Motor_Nominal_Current_H[1]=      {100};                  															//CUR *10
uint8_t Motor_Nominal_Voltage_H[1]=      {50};                 															  //VOL *2
uint8_t Motor_Nominal_Speed_H[1]=        {80};                 															  //    *5
uint8_t Buzzer_Activation_H[1]=          {0};                   															//BUA	
//-----------------------------------------
uint8_t Tune_Mode_Flash_H[1]=            {0};                   															//LRN	
uint8_t Door_Direction_H[1]=             {0};                   															//DOD	
uint8_t Command_Source_Mode_H[1]=        {0};                   															//CSR	
uint8_t Demo_H[1]=                       {0};                   															//DENO
//-----------------------------------------
uint8_t Device_Mode_H[1]=                {1};
//-----------------------------------------


//----------------------------------------------------
//------------------------ Coefficients for Office
//---------------------------------------------------- 

#define Low_speed_O 15
#define Lock_Distance_O 6
#define Accel_Lock_O 6


uint8_t Obstacle_KP_O[1]=                {22};                  															//OBP
uint8_t Learnig_Speed_O[1]=              {15};                          											//LSP
uint8_t Open_Accel_O[6]=                 {4,Accel_Lock_D,Accel_Lock_D,10,10,10};           	  //OPA
uint8_t Open_Speed_O[6]=                 {8,Low_speed_D,8,90,25,8};      										  //OPS
uint8_t Open_Current_O[6]=               {100,100,100,100,100,100};   												//OPC
uint8_t Open_Position_O[6]=              {0,3,6,Lock_Distance_D,68,95};     									//OPP
uint8_t Close_Accel_O[6]=                {4,10,6,Accel_Lock_D,Accel_Lock_D,Accel_Lock_D};     //CLA
uint8_t Close_Speed_O[6]=                {12,90,8,Low_speed_D,8,8};        										//CLS
uint8_t Close_Current_O[6]=              {100,100,100,100,100,100};   												//CLC
uint8_t Close_Position_O[6]=             {100,98,55,Lock_Distance_D,3,1};   									//CLP
uint8_t Stop_Accel_O[6]=                 {10,10,10,10,10,10};  				  											//BRA
uint8_t Stop_Speed_O[6]=                 {0,0,0,0,0,0};         															//BRS
uint8_t Stop_Current_O[6]=               {100,100,100,100,100,100};   												//BRC
uint8_t Stop_Position_O[6]=              {100,98,50,6,3,1};     															//BRP
uint8_t KP_Detection_Time_O[1]=          {10};                  															//OBD
uint8_t KP_Speed_Constant_O[1]=          {50};                 															  //OPC
uint8_t Opening_Destination_O[1]=        {100};                 															//DLO
uint8_t Closing_Destination_O[1]=        {100};                 															//DLC
uint8_t Normal_Jerk_O[1]=                {15};                  															//NOJ
uint8_t Stop_Jerk_O[1]=                  {10};                   															//RDJ
uint8_t Over_Heat_Limit_O[1]=            {50};                  															//OHL
uint8_t Over_Load_Limit_O[1]=            {15};                  															//OLL
uint8_t Over_Load_Time_O[1]=             {30};                  															//OLD
uint8_t Motor_Pole_Number_O[1]=          {16};                  															//POC
uint8_t Motor_Nominal_Current_O[1]=      {100};                  															//CUR *10
uint8_t Motor_Nominal_Voltage_O[1]=      {50};                 															  //VOL *2
uint8_t Motor_Nominal_Speed_O[1]=        {80};                 															  //    *5
uint8_t Buzzer_Activation_O[1]=          {0};                   															//BUA	
//-----------------------------------------
uint8_t Tune_Mode_Flash_O[1]=            {0};                   															//LRN	
uint8_t Door_Direction_O[1]=             {0};                   															//DOD	
uint8_t Command_Source_Mode_O[1]=        {0};                   															//CSR	
uint8_t Demo_O[1]=                       {0};                   															//DENO
//-----------------------------------------
uint8_t Device_Mode_O[1]=                {2};
//-----------------------------------------

//--------------------------------------------------------------
void writeFlash(uint32_t startAddress, char str[]) {
	HAL_FLASH_Unlock();
	FLASH_EraseInitTypeDef EraseInitStruct;
  EraseInitStruct.TypeErase   = FLASH_TYPEERASE_PAGES;
  EraseInitStruct.Page = startAddress;
  EraseInitStruct.NbPages     = 0;	
	uint32_t PAGEError = 0;
	HAL_FLASHEx_Erase(&EraseInitStruct, &PAGEError);	//Fill FF, as -1. 
	
	for(int i = 0; i < strlen(str); i++) {
//		HAL_FLASH_Program(FLASH_TYPEPROGRAM_HALFWORD, startAddress, str[i]);
//		startAddress += 2;
		//HAL_FLASH_Program(FLASH_TYPEPROGRAM_FAST, startAddress, str[i]);	//waste: we only use 1 byte of 4 bytes.
		//startAddress += 4;
		HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, startAddress, str[i]);
		startAddress += 8;
		//HAL_Delay(1);
	}
	
	HAL_FLASH_Lock();
		
