amirreza-salehpor/Menu_elevator-driver_4Digit_Sevensegment_STM32G030K8T8/Code/Core/Store_Flash/Store_Flash.c
}
//--------------------------------------------------------------
uint32_t readFlash(uint32_t addr) {
	uint32_t data = *(__IO uint32_t *)(addr);
	return data;
}
//--------------------------------------------------------------
void Erase_Flash(uint32_t startAddress, uint32_t baseAddress) {
	
	HAL_FLASH_Unlock();
	FLASH_EraseInitTypeDef EraseInitStruct;
	EraseInitStruct.Banks=FLASH_BANK_1;
  EraseInitStruct.TypeErase   = FLASH_TYPEERASE_PAGES;
  EraseInitStruct.Page = ((int)(startAddress-baseAddress))/2048;
  EraseInitStruct.NbPages     = 1;	
	uint32_t PAGEError = 0;
	HAL_FLASHEx_Erase(&EraseInitStruct, &PAGEError);	//Fill FF, as -1.
	HAL_FLASH_Lock();
	
}
//--------------------------------------------------------------
void Setup_Flash(void){
	

	
			Manage_Memory(Default_Flash_Array,0);
	

			
			
			//memcpy(&Default_Flash_Array[Byte_1_Device_Mode],&Device_Mode[0],1);
			
			Erase_Flash(FLASH_USER_START_ADDR,ADDR_FLASH_PAGE_BASE);
			
			incriment_array(1,sizeof(Default_Flash_Array),Default_Flash_Array);
			writeFlash(FLASH_USER_START_ADDR, Default_Flash_Array);	
			incriment_array(-1,sizeof(Default_Flash_Array),Default_Flash_Array);
		
}
//--------------------------------------------------------------
void incriment_array(int increment,int size_array,char array[]){	
	for(int Counter=0;Counter<=size_array;Counter++){
		array[Counter]+=increment;
	}
}
//--------------------------------------------------------------
void Manage_Memory(char array[],uint8_t mode){
	
	
	switch(mode){
		
		case 0://Default Value
			memset(&array[0],1,1);
			//--------------------------------------------------- Level 1
			memcpy(&array[1],&Obstacle_KP_D[0],1);
			memcpy(&array[2],&Open_Speed_D[3],1); //High SP Open
			memcpy(&array[3],&Close_Speed_D[1],1);//High SP Close
			memcpy(&array[4],&Open_Speed_D[1],1); //High SP Open == low speed
			memcpy(&array[5],&Close_Speed_D[3],1);//High SP Close == low speed
		  memcpy(&array[6],&Tune_Mode_Flash_D[0],1);
			memcpy(&array[7],&Door_Direction_D[0],1);
			memcpy(&array[8],&Command_Source_Mode_D[0],1);
			//--------------------------------------------------- Level 2
			memcpy(&array[14],&Open_Accel_D[4],2);
			memcpy(&array[16],&Open_Speed_D[0],1);
			memcpy(&array[17],&Open_Speed_D[2],1);		
			memcpy(&array[18],&Open_Speed_D[4],2);
			memcpy(&array[20],&Close_Accel_D[1],2);		
			memcpy(&array[22],&Close_Speed_D[0],1);
			memcpy(&array[23],&Close_Speed_D[2],1);
			memcpy(&array[24],&Close_Speed_D[4],2);
			memcpy(&array[26],&Open_Position_D[3],1);
			memcpy(&array[27],&Close_Position_D[3],1);
			memcpy(&array[28],&Buzzer_Activation_D[0],1);
			//--------------------------------------------------- Level 3
			memcpy(&array[34],&Open_Accel_D[0],4);
			memcpy(&array[38],&Open_Current_D[0],6);
			memcpy(&array[44],&Close_Accel_D[0],1);
			memcpy(&array[45],&Close_Accel_D[3],3);
			memcpy(&array[48],&KP_Detection_Time_D[0],1);
			memcpy(&array[49],&Normal_Jerk_D[0],1);
			memcpy(&array[50],&Stop_Jerk_D[0],1);
			memcpy(&array[51],&Over_Load_Limit_D[0],1);
			memcpy(&array[52],&Over_Load_Time_D[0],1);
			memcpy(&array[53],&Motor_Pole_Number_D[0],1);
			memcpy(&array[54],&Motor_Nominal_Current_D[0],1);
			memcpy(&array[55],&Motor_Nominal_Voltage_D[0],1);
			memcpy(&array[56],&Motor_Nominal_Speed_D[0],1);
			memcpy(&array[57],&Opening_Destination_D[0],1);
			memcpy(&array[58],&Closing_Destination_D[0],1);
			//--------------------------------------------------- Level 4
			memcpy(&array[63],&Learnig_Speed_D[0],1);
			memcpy(&array[64],&Open_Position_D[0],3);
			memcpy(&array[67],&Open_Position_D[4],2);
			memcpy(&array[69],&Close_Current_D[0],6);
			memcpy(&array[75],&Close_Position_D[0],3);
			memcpy(&array[78],&Close_Position_D[4],2);
			memcpy(&array[80],&Stop_Accel_D[0],6);
			memcpy(&array[86],&Stop_Speed_D[0],6);
			memcpy(&array[92],&Stop_Current_D[0],6);
			memcpy(&array[98],&Stop_Position_D[0],6);
			memcpy(&array[104],&KP_Speed_Constant_D[0],1);
			memcpy(&array[105],&Over_Heat_Limit_D[0],1);
			//---------------------------------------------------------------- Reserve
			memcpy(&array[Byte_1_Device_Mode],&Device_Mode_D[0],1);
			
			
			break;
			
		case 1://Commercial Value
			memset(&array[0],1,1);
			//--------------------------------------------------- Level 1
			memcpy(&array[1],&Obstacle_KP_C[0],1);
			memcpy(&array[2],&Open_Speed_C[3],1); //High SP Open
			memcpy(&array[3],&Close_Speed_C[1],1);//High SP Close
			memcpy(&array[4],&Open_Speed_C[1],1); //High SP Open == low speed
			memcpy(&array[5],&Close_Speed_C[3],1);//High SP Close == low speed
		  memcpy(&array[6],&Tune_Mode_Flash_C[0],1);
			memcpy(&array[7],&Door_Direction_C[0],1);
			memcpy(&array[8],&Command_Source_Mode_C[0],1);
			//--------------------------------------------------- Level 2
			memcpy(&array[14],&Open_Accel_C[4],2);
			memcpy(&array[16],&Open_Speed_C[0],1);
			memcpy(&array[17],&Open_Speed_C[2],1);		
			memcpy(&array[18],&Open_Speed_C[4],2);
			memcpy(&array[20],&Close_Accel_C[1],2);		
			memcpy(&array[22],&Close_Speed_C[0],1);
			memcpy(&array[23],&Close_Speed_C[2],1);
			memcpy(&array[24],&Close_Speed_C[4],2);
			memcpy(&array[26],&Open_Position_C[3],1);
			memcpy(&array[27],&Close_Position_C[3],1);
			memcpy(&array[28],&Buzzer_Activation_C[0],1);
			//--------------------------------------------------- Level 3
			memcpy(&array[34],&Open_Accel_C[0],4);
			memcpy(&array[38],&Open_Current_C[0],6);
			memcpy(&array[44],&Close_Accel_C[0],1);
			memcpy(&array[45],&Close_Accel_C[3],3);
			memcpy(&array[48],&KP_Detection_Time_C[0],1);
			memcpy(&array[49],&Normal_Jerk_C[0],1);
			memcpy(&array[50],&Stop_Jerk_C[0],1);
			memcpy(&array[51],&Over_Load_Limit_C[0],1);
			memcpy(&array[52],&Over_Load_Time_C[0],1);
			memcpy(&array[53],&Motor_Pole_Number_C[0],1);
			memcpy(&array[54],&Motor_Nominal_Current_C[0],1);
			memcpy(&array[55],&Motor_Nominal_Voltage_C[0],1);
			memcpy(&array[56],&Motor_Nominal_Speed_C[0],1);
			memcpy(&array[57],&Opening_Destination_C[0],1);
			memcpy(&array[58],&Closing_Destination_C[0],1);
			//--------------------------------------------------- Level 4
			memcpy(&array[63],&Learnig_Speed_C[0],1);
			memcpy(&array[64],&Open_Position_C[0],3);
			memcpy(&array[67],&Open_Position_C[4],2);
			memcpy(&array[69],&Close_Current_C[0],6);
			memcpy(&array[75],&Close_Position_C[0],3);
			memcpy(&array[78],&Close_Position_C[4],2);
			memcpy(&array[80],&Stop_Accel_C[0],6);
			memcpy(&array[86],&Stop_Speed_C[0],6);
			memcpy(&array[92],&Stop_Current_C[0],6);
			memcpy(&array[98],&Stop_Position_C[0],6);
			memcpy(&array[104],&KP_Speed_Constant_C[0],1);
			memcpy(&array[105],&Over_Heat_Limit_C[0],1);
			//---------------------------------------------------------------- Reserve
			memcpy(&array[Byte_1_Device_Mode],&Device_Mode_C[0],1);
			
			break;
			
		case 2://Household Value
			memset(&array[0],1,1);
			//--------------------------------------------------- Level 1
			memcpy(&array[1],&Obstacle_KP_H[0],1);
			memcpy(&array[2],&Open_Speed_H[3],1); //High SP Open
			memcpy(&array[3],&Close_Speed_H[1],1);//High SP Close
			memcpy(&array[4],&Open_Speed_H[1],1); //High SP Open == low speed
			memcpy(&array[5],&Close_Speed_H[3],1);//High SP Close == low speed
		  memcpy(&array[6],&Tune_Mode_Flash_H[0],1);
			memcpy(&array[7],&Door_Direction_H[0],1);
			memcpy(&array[8],&Command_Source_Mode_H[0],1);
			//--------------------------------------------------- Level 2
			memcpy(&array[14],&Open_Accel_H[4],2);
			memcpy(&array[16],&Open_Speed_H[0],1);
			memcpy(&array[17],&Open_Speed_H[2],1);		
			memcpy(&array[18],&Open_Speed_H[4],2);
			memcpy(&array[20],&Close_Accel_H[1],2);		
			memcpy(&array[22],&Close_Speed_H[0],1);
			memcpy(&array[23],&Close_Speed_H[2],1);
			memcpy(&array[24],&Close_Speed_H[4],2);
			memcpy(&array[26],&Open_Position_H[3],1);
			memcpy(&array[27],&Close_Position_H[3],1);
			memcpy(&array[28],&Buzzer_Activation_H[0],1);
			//--------------------------------------------------- Level 3
			memcpy(&array[34],&Open_Accel_H[0],4);
			memcpy(&array[38],&Open_Current_H[0],6);
			memcpy(&array[44],&Close_Accel_H[0],1);
			memcpy(&array[45],&Close_Accel_H[3],3);
			memcpy(&array[48],&KP_Detection_Time_H[0],1);
			memcpy(&array[49],&Normal_Jerk_H[0],1);
			memcpy(&array[50],&Stop_Jerk_H[0],1);
			memcpy(&array[51],&Over_Load_Limit_H[0],1);
			memcpy(&array[52],&Over_Load_Time_H[0],1);
			memcpy(&array[53],&Motor_Pole_Number_H[0],1);
			memcpy(&array[54],&Motor_Nominal_Current_H[0],1);
			memcpy(&array[55],&Motor_Nominal_Voltage_H[0],1);
			memcpy(&array[56],&Motor_Nominal_Speed_H[0],1);
			memcpy(&array[57],&Opening_Destination_H[0],1);
			memcpy(&array[58],&Closing_Destination_H[0],1);
			//--------------------------------------------------- Level 4
			memcpy(&array[63],&Learnig_Speed_H[0],1);
			memcpy(&array[64],&Open_Position_H[0],3);
			memcpy(&array[67],&Open_Position_H[4],2);
			memcpy(&array[69],&Close_Current_H[0],6);
			memcpy(&array[75],&Close_Position_H[0],3);
			memcpy(&array[78],&Close_Position_H[4],2);
			memcpy(&array[80],&Stop_Accel_H[0],6);
			memcpy(&array[86],&Stop_Speed_H[0],6);
			memcpy(&array[92],&Stop_Current_H[0],6);
			memcpy(&array[98],&Stop_Position_H[0],6);
			memcpy(&array[104],&KP_Speed_Constant_H[0],1);
			memcpy(&array[105],&Over_Heat_Limit_H[0],1);
			//---------------------------------------------------------------- Reserve
			memcpy(&array[Byte_1_Device_Mode],&Device_Mode_H[0],1);
			
			break;
			
		case 3://Office Value
			memset(&array[0],1,1);
			//--------------------------------------------------- Level 1
			memcpy(&array[1],&Obstacle_KP_O[0],1);
			memcpy(&array[2],&Open_Speed_O[3],1); //High SP Open
			memcpy(&array[3],&Close_Speed_O[1],1);//High SP Close
			memcpy(&array[4],&Open_Speed_O[1],1); //High SP Open == low speed
			memcpy(&array[5],&Close_Speed_O[3],1);//High SP Close == low speed
		  memcpy(&array[6],&Tune_Mode_Flash_O[0],1);
			memcpy(&array[7],&Door_Direction_O[0],1);
			memcpy(&array[8],&Command_Source_Mode_O[0],1);
			//--------------------------------------------------- Level 2
			memcpy(&array[14],&Open_Accel_O[4],2);
			memcpy(&array[16],&Open_Speed_O[0],1);
			memcpy(&array[17],&Open_Speed_O[2],1);		
			memcpy(&array[18],&Open_Speed_O[4],2);
			memcpy(&array[20],&Close_Accel_O[1],2);		
			memcpy(&array[22],&Close_Speed_O[0],1);
			memcpy(&array[23],&Close_Speed_O[2],1);
			memcpy(&array[24],&Close_Speed_O[4],2);
			memcpy(&array[26],&Open_Position_O[3],1);
			memcpy(&array[27],&Close_Position_O[3],1);
			memcpy(&array[28],&Buzzer_Activation_O[0],1);
			//--------------------------------------------------- Level 3
			memcpy(&array[34],&Open_Accel_O[0],4);
			memcpy(&array[38],&Open_Current_O[0],6);
			memcpy(&array[44],&Close_Accel_O[0],1);
			memcpy(&array[45],&Close_Accel_O[3],3);
			memcpy(&array[48],&KP_Detection_Time_O[0],1);
			memcpy(&array[49],&Normal_Jerk_O[0],1);
			memcpy(&array[50],&Stop_Jerk_O[0],1);
			memcpy(&array[51],&Over_Load_Limit_O[0],1);
			memcpy(&array[52],&Over_Load_Time_O[0],1);
			memcpy(&array[53],&Motor_Pole_Number_O[0],1);
			memcpy(&array[54],&Motor_Nominal_Current_O[0],1);
			memcpy(&array[55],&Motor_Nominal_Voltage_O[0],1);
			memcpy(&array[56],&Motor_Nominal_Speed_O[0],1);
			memcpy(&array[57],&Opening_Destination_O[0],1);
			memcpy(&array[58],&Closing_Destination_O[0],1);
			//--------------------------------------------------- Level 4
			memcpy(&array[63],&Learnig_Speed_O[0],1);
			memcpy(&array[64],&Open_Position_O[0],3);
			memcpy(&array[67],&Open_Position_O[4],2);
			memcpy(&array[69],&Close_Current_O[0],6);
			memcpy(&array[75],&Close_Position_O[0],3);
			memcpy(&array[78],&Close_Position_O[4],2);
			memcpy(&array[80],&Stop_Accel_O[0],6);
			memcpy(&array[86],&Stop_Speed_O[0],6);
			memcpy(&array[92],&Stop_Current_O[0],6);
			memcpy(&array[98],&Stop_Position_O[0],6);
			memcpy(&array[104],&KP_Speed_Constant_O[0],1);
			memcpy(&array[105],&Over_Heat_Limit_O[0],1);
			//---------------------------------------------------------------- Reserve
			memcpy(&array[Byte_1_Device_Mode],&Device_Mode_O[0],1);
			
			break;	
		}
}


